app/views/elements/edit.html.erb

SELECT "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      <%= f.label :side,"陣営" %>
      <%= f.select :side, Element.sides_i18n.keys.map { |k| [t("enums.element.side.#{k}"), k] } %>