app/views/tactics/new.html.erb

      <%= f.label :field_id,"フィールド", required: true %>
      <%= f.select :field_id, options_from_collection_for_select(Field.all, :id, :name), include_blank: "--選択して下さい--", required: true %><br>
---
SELECT "fields".* FROM "fields"