app/controllers/elements_controller.rb

  def create
    @element = Element.new(element_params)
    @element.x_coordinate = 50
    @element.y_coordinate = 50
    if  @element.save
---
INSERT INTO "elements" ("tactic_id", "name", "side", "x_coordinate", "y_coordinate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["tactic_id", "1"], ["name", "1P"], ["side", 1], ["x_coordinate", "50"], ["y_coordinate", "50"], ["created_at", "2023-01-17 11:40:24.941953"], ["updated_at", "2023-01-17 11:40:24.941953"]]

  def edit
    @element = Element.find(params[:id])
---
SELECT "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @element = Element.find(params[:id])
    if Tactic.find(@element.tactic_id).user_id.to_i == current_user.id
    # @element = Element.find_by(params[:name])
      if  @element.update(element_params)
---
SELECT "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tactics".* FROM "tactics" WHERE "tactics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "elements" SET "x_coordinate" = ?, "y_coordinate" = ?, "updated_at" = ? WHERE "elements"."id" = ?  [["x_coordinate", "412px"], ["y_coordinate", "222px"], ["updated_at", "2023-01-17 13:24:14.617661"], ["id", 1]]