app/controllers/fields_controller.rb

INSERT INTO "fields" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "円"], ["created_at", "2023-01-17 11:40:11.118752"], ["updated_at", "2023-01-17 11:40:11.118752"]]
---
  def create
    @field = Field.new(field_params)
      if  @field.save

SELECT "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    if current_user.name == "admin"
      @field = Field.find(params[:id])

SELECT "fields".* FROM "fields"
---
  def index
    @fields = Field.all

SELECT "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "fields" SET "name" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["name", "野球場"], ["updated_at", "2023-01-20 05:59:39.896514"], ["id", 3]]
---
  def update
    if current_user.name == "admin"
      @field = Field.find(params[:id])
      if  @field.update(field_params)

SELECT "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    if current_user.name == "admin"
      @field = Field.find(params[:id])