app/controllers/tactics_controller.rb

SELECT "elements".* FROM "elements" WHERE "elements"."tactic_id" = ? ORDER BY "elements"."name" ASC  [["tactic_id", "1"]]
---
  def edit
    @tactic = Tactic.find(params[:id])
    @tactics = current_user.tactics.page(params[:page])
    @field = Field.find(@tactic.field_id)
    @elements = @tactic.elements.order(:name)