app/controllers/tactics_controller.rb

  def create
    @tactic = Tactic.new(tactic_params)
    @tactic.user_id = current_user.id
    if  @tactic.save
---
INSERT INTO "tactics" ("user_id", "field_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "1"], ["field_id", "1"], ["name", "AAAA"], ["created_at", "2023-01-17 11:40:18.148498"], ["updated_at", "2023-01-17 11:40:18.148498"]]

  def edit
    @tactic = Tactic.find(params[:id])
    @tactics = current_user.tactics.page(params[:page])
    @field = Field.find(@tactic.field_id)
    @elements = @tactic.elements.page(params[:page])
---
SELECT "tactics".* FROM "tactics" WHERE "tactics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tactics".* FROM "tactics" WHERE "tactics"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", "1"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tactics" WHERE "tactics"."user_id" = ?  [["user_id", "1"]]
SELECT "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "elements".* FROM "elements" WHERE "elements"."tactic_id" = ? LIMIT ? OFFSET ?  [["tactic_id", "1"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "elements" WHERE "elements"."tactic_id" = ?  [["tactic_id", "1"]]

  def update
    @tactic = Tactic.find(params[:id])
    if  @tactic.update(tactic_params)
---
SELECT "tactics".* FROM "tactics" WHERE "tactics"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "tactics" SET "name" = ?, "updated_at" = ? WHERE "tactics"."id" = ?  [["name", "バント"], ["updated_at", "2023-01-20 06:03:53.248579"], ["id", 6]]

  def destroy
    @tactic = Tactic.find(params[:id])
    @tactic.destroy
---
SELECT "tactics".* FROM "tactics" WHERE "tactics"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tactics" WHERE "tactics"."id" = ?  [["id", 3]]