app/controllers/tactics/elements_controller.rb

  def update
    tactic = Tactic.find(params[:tactic_id])
    if tactic.user_id.to_i == current_user.id
      tactic.elements.each do |element|
        # byebug
        element.update(x_coordinate: params['elements'][element.id.to_s]['x_coordinate'], y_coordinate: params['elements'][element.id.to_s]['y_coordinate'])
---
SELECT "tactics".* FROM "tactics" WHERE "tactics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "elements".* FROM "elements" WHERE "elements"."tactic_id" = ?  [["tactic_id", "2"]]
UPDATE "elements" SET "x_coordinate" = ?, "y_coordinate" = ?, "updated_at" = ? WHERE "elements"."id" = ?  [["x_coordinate", "309px"], ["y_coordinate", "88px"], ["updated_at", "2023-01-18 11:47:54.500481"], ["id", 7]]